<?php

namespace Database\Seeders;

use App\Models\Category;
use Illuminate\Database\Seeder;

class CategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $value1 = [

            'en_name'=>'حدائق منزلية',
            'ar_name'=>'حدائق منزلية',
            'en_breif'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
            'ar_brief'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
            'image'=>'1.webp',
            'en_overview'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
            'ar_overview'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
            'order'=>1,

        ];


    Category::create($value1);
    $value2 = [

        'en_name'=>'أسطح منزلية',
        'ar_name'=>'أسطح منزلية',
        'en_breif'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
        'ar_brief'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
        'image'=>'2.webp',
        'en_overview'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
        'ar_overview'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
        'order'=>2,

    ];


Category::create($value2);
$value3 = [

    'en_name'=>'حوائط منزلية',
    'ar_name'=>'حوائط منزلية',
    'en_breif'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
    'ar_brief'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
    'image'=>'3.webp',
    'en_overview'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
    'ar_overview'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
    'order'=>3,

];


Category::create($value3);
$value4 = [

    'en_name'=>'أسقف منزلية',
    'ar_name'=>'أسقف منزلية',
    'en_breif'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
    'ar_brief'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
    'image'=>'4.webp',
    'en_overview'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
    'ar_overview'=>'عند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم',
    'order'=>4,

];


Category::create($value4);
    }
}
